专业技能
* 熟悉JavaScript, 掌握ES6常用语法
* 熟练使用Vue.js 全家桶开发项目，深入了解其原理
* 熟悉前端工程化，了解Webpack常见的优化方案
* 了解公众号、小程序开发

工作经历
成都中教智汇有限公司 前端开发工程师 2018-4 ~ 至今
业务线项目开发维护、公用组件开发、业务框架开发维护、新员工培训

成都维仕小额贷款有限公司 前端开发工程师 2017-5~2018-3
基于微信公众号的小额贷款app和车险购置app开发维护

项目经历

前端业务框架升级

项目概述: 
响应公司的技术栈升级， 将jQuery搭建的旧版框架用Vue + Element进行升级重写，在极大减少框架代码
量情况下保证新框架和业务线代码完全兼容，并使其拥有更佳的视觉效果和可扩展性

个人职责:
1. 
2. 导航栏、内容栏、换肤等模块编码开发工作
3. 对接旧框架进行兼容性适配
4. 框架升级文档撰写
项目成果:
新框架完美兼容旧版的jQuery框架，对业务线开发人员零影响，旧框架可无缝切换至新框架;客户对新框架反响良好，
在易用性和界面美观方面均有较大提升。

可个性配置门户网站

项目概述: 
vue实现的可拖拽自由配置式的门户首页生成项目，使得实施人员可根据学校的具体需求，通过拖拽配置生成对应的门户首页

个人职责:
1. 负责模板设计部分编码工作
2. 负责门户核心功能的编码工作
3. 协助其他开发人员进行功能模块的编写工作

项目成果:


